# Pandas

In [1]:
# import pandas
import pandas as pd

## Series

**A Series** is a ***one-dimensional object*** containing a sequence of values, very similar to a column of data in an Excel spreadsheet. The Series data structure has an associated index which can be either numbers, or strings (ie. named labels).

In [2]:
marks_series = pd.Series([45, 67, 98, 23, 17])

marks_series

0    45
1    67
2    98
3    23
4    17
dtype: int64

In [3]:
marks_series[0:2]

0    45
1    67
dtype: int64

### Using named labels
A label can be used to identify each data point (row) by providing a list of the desired labels to the index property of the Series object.

In [4]:
marks_update = pd.Series([76, 78, 67, 93, 81], index=['John', 'Alex', 'Elon', 'Jacinta', 'Lily'])

marks_update

John       76
Alex       78
Elon       67
Jacinta    93
Lily       81
dtype: int64

In [5]:
# Accessing labelled series
marks_update['John':'Jacinta'] # inclusive

John       76
Alex       78
Elon       67
Jacinta    93
dtype: int64

In [6]:
marks_update[0:4] # exclusive

John       76
Alex       78
Elon       67
Jacinta    93
dtype: int64

# Elementwise operations

In [7]:
# Multiplication
marks_update * 1.05

John       79.80
Alex       81.90
Elon       70.35
Jacinta    97.65
Lily       85.05
dtype: float64

In [8]:
# Addition
marks_update + 3

John       79
Alex       81
Elon       70
Jacinta    96
Lily       84
dtype: int64

In [9]:
# series addition
cat_marks = pd.Series([12, 14, 22, 17, 20], index=['John', 'Lily', 'Jacinta', 'Alex', 'Elon'])

new_marks = marks_update + cat_marks

# Not the order of index does not matter but they must existing in the first series

new_marks

Alex        95
Elon        87
Jacinta    115
John        88
Lily        95
dtype: int64

In [10]:
# Boolean selection
new_marks < 100

Alex        True
Elon        True
Jacinta    False
John        True
Lily        True
dtype: bool

In [11]:
# selecting the data that is true based on the condition
new_marks[new_marks > 90]

Alex        95
Jacinta    115
Lily        95
dtype: int64

## DataFrame

The **DataFrame** is another data structure in pandas. A DataFrame is a ***two-dimensional*** array of values. Much like an Excel spreadsheet, it is a rectangular table of columns and rows with both a row index and a column index. It can, somewhat, be thought of as a collection of Series objects, each of which can have a different data type (e.g., strings, numbers). 

Typically, pandas will import data (e.g., from a csv file) as a DataFrame. However, a DataFrame may be constructed, for example, by using a dictionary (key/value pairs) with the key being the column name and the value being a list of row values.

In [12]:
data = {
    'name': ['Aloyce', 'Njeri', 'Wambua', 'Rashid', 'Lulu', 'Kipyegon', 'Wanjala', 'Betty', 'Clare', 'Didimus'],
    'gender': ['Male', 'Female', 'Female', 'Male', 'Female', 'Male', 'Male', 'Female', 'Female', 'Male'],
    'age': [30, 24, 35, 42, 29, 19, 27, 49, 28, 39]
}

df = pd.DataFrame(data=data)

df

       name  gender  age
0    Aloyce    Male   30
1     Njeri  Female   24
2    Wambua  Female   35
3    Rashid    Male   42
4      Lulu  Female   29
5  Kipyegon    Male   19
6   Wanjala    Male   27
7     Betty  Female   49
8     Clare  Female   28
9   Didimus    Male   39

In [13]:
# Using head() function to select the first 5 rows
df.head() # default is 5 rows but you can pass argument indicating the number of rows

     name  gender  age
0  Aloyce    Male   30
1   Njeri  Female   24
2  Wambua  Female   35
3  Rashid    Male   42
4    Lulu  Female   29

In [14]:
df.head(10)

       name  gender  age
0    Aloyce    Male   30
1     Njeri  Female   24
2    Wambua  Female   35
3    Rashid    Male   42
4      Lulu  Female   29
5  Kipyegon    Male   19
6   Wanjala    Male   27
7     Betty  Female   49
8     Clare  Female   28
9   Didimus    Male   39

In [15]:
# using tail() to display the last 5 rows
df.tail()

       name  gender  age
5  Kipyegon    Male   19
6   Wanjala    Male   27
7     Betty  Female   49
8     Clare  Female   28
9   Didimus    Male   39

### sample()
Instead of having the DataFrame simply return the first five or last five rows, as head() and tail(), respectively, do, the DataFrame's sample() method returns a random sampling of rows from the dataset. The number passed to the method determines the number of rows returned.

In [16]:
df.sample(5)

       name  gender  age
2    Wambua  Female   35
3    Rashid    Male   42
5  Kipyegon    Male   19
7     Betty  Female   49
1     Njeri  Female   24

### Column selection
You can retrieve a column from a DataFrame by using the column's name between square brackets. (A Series object is returned.):

In [17]:
df['name']

0      Aloyce
1       Njeri
2      Wambua
3      Rashid
4        Lulu
5    Kipyegon
6     Wanjala
7       Betty
8       Clare
9     Didimus
Name: name, dtype: object

You can also use dot notation to retrieve a column (Series) from a DataFrame, but only if the column name is a valid Python variable name (e.g., no spaces):

In [18]:
df.name

0      Aloyce
1       Njeri
2      Wambua
3      Rashid
4        Lulu
5    Kipyegon
6     Wanjala
7       Betty
8       Clare
9     Didimus
Name: name, dtype: object

<div class="alert alert-block alert-success">
<b>Note:</b> Row selection syntax is used to select rows (e.g., df[:3]).
    Passing the string name of a column selects columns (e.g., df["Age"]). 
</div>

In [19]:
print(df[:3])

print(df['gender'])

print(df[['age', 'name']])

     name  gender  age
0  Aloyce    Male   30
1   Njeri  Female   24
2  Wambua  Female   35
0      Male
1    Female
2    Female
3      Male
4    Female
5      Male
6      Male
7    Female
8    Female
9      Male
Name: gender, dtype: object
   age      name
0   30    Aloyce
1   24     Njeri
2   35    Wambua
3   42    Rashid
4   29      Lulu
5   19  Kipyegon
6   27   Wanjala
7   49     Betty
8   28     Clare
9   39   Didimus

In [20]:
df =  pd.read_csv('heart_disease.csv')

df.head()

   age     sex  chest_pain  rest_bp  chol  max_hr  st_depr target
0   63  Female           3      145   233     150      2.3    Yes
1   37  Female           2      130   250     187      3.5    Yes
2   41    Male           1      130   204     172      1.4    Yes
3   56  Female           1      120   236     178      0.8    Yes
4   57    Male           0      120   354     163      0.6    Yes

# Dropping Rows and Columns

You can use the drop() method on the DataFrame to drop entries. Adding the desired axis will determine whether rows or columns will be dropped. There are two axes in pandas:

- Axis 0 indicates that you intend to drop a row. 
- Axis 1 indicates that you intend to drop a column.

In [21]:
# Dropping a row, axis=0 indicates rows
df.drop([1, 3, 5], axis=0) # returns a copy of modified dataframe

     age     sex  chest_pain  rest_bp  chol  max_hr  st_depr target
0     63  Female           3      145   233     150      2.3    Yes
2     41    Male           1      130   204     172      1.4    Yes
4     57    Male           0      120   354     163      0.6    Yes
6     56    Male           1      140   294     153      1.3    Yes
7     44  Female           1      120   263     173      0.0    Yes
..   ...     ...         ...      ...   ...     ...      ...    ...
298   57    Male           0      140   241     123      0.2     No
299   45  Female           3      110   264     132      1.2     No
300   68  Female           0      144   193     141      3.4     No
301   57  Female           0      130   131     115      1.2     No
302   57    Male           1      130   236     174      0.0     No

[300 rows x 8 columns]

In [22]:
# Dropping a row by specifying the `index` parameter
df.drop(index=[0, 1, 2, 3]) # returns a copy of modified dataframe

     age     sex  chest_pain  rest_bp  chol  max_hr  st_depr target
4     57    Male           0      120   354     163      0.6    Yes
5     57  Female           0      140   192     148      0.4    Yes
6     56    Male           1      140   294     153      1.3    Yes
7     44  Female           1      120   263     173      0.0    Yes
8     52  Female           2      172   199     162      0.5    Yes
..   ...     ...         ...      ...   ...     ...      ...    ...
298   57    Male           0      140   241     123      0.2     No
299   45  Female           3      110   264     132      1.2     No
300   68  Female           0      144   193     141      3.4     No
301   57  Female           0      130   131     115      1.2     No
302   57    Male           1      130   236     174      0.0     No

[299 rows x 8 columns]

In [23]:
# You can also drop rows inplace of the dataframe without creating copies
df.drop([300, 301], inplace=True)
df

     age     sex  chest_pain  rest_bp  chol  max_hr  st_depr target
0     63  Female           3      145   233     150      2.3    Yes
1     37  Female           2      130   250     187      3.5    Yes
2     41    Male           1      130   204     172      1.4    Yes
3     56  Female           1      120   236     178      0.8    Yes
4     57    Male           0      120   354     163      0.6    Yes
..   ...     ...         ...      ...   ...     ...      ...    ...
296   63    Male           0      124   197     136      0.0     No
297   59  Female           0      164   176      90      1.0     No
298   57    Male           0      140   241     123      0.2     No
299   45  Female           3      110   264     132      1.2     No
302   57    Male           1      130   236     174      0.0     No

[301 rows x 8 columns]

# Dropping columns

In [24]:
df.drop("sex", axis=1) # axis = 1 -> represents columns while axis=0 -> rows
# returns a copy of the dataframe without modifying the main one.

     age  chest_pain  rest_bp  chol  max_hr  st_depr target
0     63           3      145   233     150      2.3    Yes
1     37           2      130   250     187      3.5    Yes
2     41           1      130   204     172      1.4    Yes
3     56           1      120   236     178      0.8    Yes
4     57           0      120   354     163      0.6    Yes
..   ...         ...      ...   ...     ...      ...    ...
296   63           0      124   197     136      0.0     No
297   59           0      164   176      90      1.0     No
298   57           0      140   241     123      0.2     No
299   45           3      110   264     132      1.2     No
302   57           1      130   236     174      0.0     No

[301 rows x 7 columns]

In [25]:
# You can also drop columns by specifying the columns parameter in the drop method
df.drop(columns=['age', 'sex']) # returns a copy of the dataframe without modifying the original dataframe

     chest_pain  rest_bp  chol  max_hr  st_depr target
0             3      145   233     150      2.3    Yes
1             2      130   250     187      3.5    Yes
2             1      130   204     172      1.4    Yes
3             1      120   236     178      0.8    Yes
4             0      120   354     163      0.6    Yes
..          ...      ...   ...     ...      ...    ...
296           0      124   197     136      0.0     No
297           0      164   176      90      1.0     No
298           0      140   241     123      0.2     No
299           3      110   264     132      1.2     No
302           1      130   236     174      0.0     No

[301 rows x 6 columns]

In [26]:
# You can also drop columns inplace in the original dataframe
df.drop(columns=['age', 'sex'], inplace=True)
df

     chest_pain  rest_bp  chol  max_hr  st_depr target
0             3      145   233     150      2.3    Yes
1             2      130   250     187      3.5    Yes
2             1      130   204     172      1.4    Yes
3             1      120   236     178      0.8    Yes
4             0      120   354     163      0.6    Yes
..          ...      ...   ...     ...      ...    ...
296           0      124   197     136      0.0     No
297           0      164   176      90      1.0     No
298           0      140   241     123      0.2     No
299           3      110   264     132      1.2     No
302           1      130   236     174      0.0     No

[301 rows x 6 columns]

# Lesson 3: Selecting and Filtering Rows and Columns

In [27]:
# Create a new DataFrame

sample_data = [
                [0,1,2,3,4,5,6,7,8,9],
                [10,11,12,13,14,15,16,17,18,19],
                [20,21,22,23,24,25,26,27,28,29],
                [30,31,32,33,34,35,36,37,38,39],
                [40,41,42,43,44,45,46,47,48,49],
                [50,51,52,53,54,55,56,57,58,59],
                [70,71,72,73,74,75,76,77,78,79],
                [80,81,82,83,84,85,86,87,88,89],
                [90,91,92,93,94,95,96,97,98,99],
              ]

data = pd.DataFrame(data = sample_data, columns = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
data

    a   b   c   d   e   f   g   h   i   j
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  70  71  72  73  74  75  76  77  78  79
7  80  81  82  83  84  85  86  87  88  89
8  90  91  92  93  94  95  96  97  98  99

## Using loc
Using `loc` (short for location) allows you to select a subset of the rows and columns **using the label/name of the row/column**. If the rows were not given labels (named), then their index position is their label.

Within the square brackets, the selection preceding the (optional) comma refers to the rows you would like selected. Following the (optional) comma is the selection referring to the desired columns. The selection is inclusive of the end position.

In [28]:
data.loc[:5] # selects all rows from the start to index=5 (inclusive)

    a   b   c   d   e   f   g   h   i   j
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59

<div class="alert alert-block alert-success">
<b>Note:</b> If no comma follows the row selection then all columns are returned. </div>

In [29]:
# You can also specify the rows and columns inside the square brackets of `loc`
data.loc[3:5, 'a']

3    30
4    40
5    50
Name: a, dtype: int64

In [30]:
# selecting consecative rows and columns
data.loc[4:8, 'a':'d']

    a   b   c   d
4  40  41  42  43
5  50  51  52  53
6  70  71  72  73
7  80  81  82  83
8  90  91  92  93

In [31]:
data.loc[3:5, ['a', 'b', 'd', 'i']] # selects multiple rows

    a   b   d   i
3  30  31  33  38
4  40  41  43  48
5  50  51  53  58

## Using iloc
Using `iloc` allows you to select a subset of the rows and columns **using their index position**. Thus, only integers can be used.

Within the square brackets, the selection preceding the (optional) comma refers to the rows you would like selected. Following the (optional) comma is the selection referring to the desired columns. The selections will **_not_** include the end position.

In [32]:
# selecting specific rows
data.iloc[:5] # exclusive, the row at index 5 is excluded
# No comma indicates that all the columns will be returned

    a   b   c   d   e   f   g   h   i   j
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49

<div class="alert alert-block alert-warning">
<b>Alert:</b> When selecting by index position (location), the end point (stopping position) is NOT included.</div>

In [33]:
data.iloc[2:6, 2:6] # selecting specific rows and colums

    c   d   e   f
2  22  23  24  25
3  32  33  34  35
4  42  43  44  45
5  52  53  54  55

In [34]:
data.iloc[[5, 0, 3], [9, 5, 0]]  # Returns rows and columns in the order listed.

    j   f   a
5  59  55  50
0   9   5   0
3  39  35  30

## Setting values
You can modify values within a DataFrame by first selecting the rows and columns to be changed, and then setting that selection to the desired value:

#### Using loc
*Select the rows where column "j" is greater than 50 (indicated by everything before the comma). Then, just select column "j" (indicated by what follows the comma). Now, set those values equal to 100*:

In [35]:
data.loc[data['j'] > 50, 'j'] = 150

data

    a   b   c   d   e   f   g   h   i    j
0   0   1   2   3   4   5   6   7   8    9
1  10  11  12  13  14  15  16  17  18   19
2  20  21  22  23  24  25  26  27  28   29
3  30  31  32  33  34  35  36  37  38   39
4  40  41  42  43  44  45  46  47  48   49
5  50  51  52  53  54  55  56  57  58  150
6  70  71  72  73  74  75  76  77  78  150
7  80  81  82  83  84  85  86  87  88  150
8  90  91  92  93  94  95  96  97  98  150

#### Using iloc
*Select the rows with index positions 5 through 8, but not including 8 (indicated by everything before the comma). Then, just select the column at index position 0, the first column (indicated by what follows the comma). Now, set those values equal to -100*:

In [36]:
data.iloc[5:8, 0] = -100

data

     a   b   c   d   e   f   g   h   i    j
0    0   1   2   3   4   5   6   7   8    9
1   10  11  12  13  14  15  16  17  18   19
2   20  21  22  23  24  25  26  27  28   29
3   30  31  32  33  34  35  36  37  38   39
4   40  41  42  43  44  45  46  47  48   49
5 -100  51  52  53  54  55  56  57  58  150
6 -100  71  72  73  74  75  76  77  78  150
7 -100  81  82  83  84  85  86  87  88  150
8   90  91  92  93  94  95  96  97  98  150